phynics/axoloty-embedded/Platforms/esp32c6-idf/sdkconfig.defaults
# Target chip
CONFIG_IDF_TARGET="esp32c6"

# Enable reproducible builds (deterministic .bin output)
CONFIG_APP_REPRODUCIBLE_BUILD=y

# Swift app tuning. Embedded Swift reserves a ~16 KB temporary-allocation
# workspace per non-inlined function frame, and the smoke/agent entry point
# nests several (app_main plus the generated-corpus runner). The original
# 12 KB main-task stack tripped the hardware stack guard before app_main ran
# its first check; 24 KB, 32 KB, 64 KB, and 96 KB overflowed deeper in the
# wire/agent corpus. 128 KB leaves headroom for the summary/benchmark phases
# while keeping the fixed storage budgets explicit.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=131072
CONFIG_FREERTOS_HZ=1000
CONFIG_HEAP_TRACING_STANDALONE=y

# Single-app layout sized for the production Swift + Wi-Fi/MQTT image.
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
